app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
---
    public function index()
    {
        $clientes['clientes'] = $this->clientesModel->findAll();

DELETE FROM `clientes`
WHERE `id` IN ('22')
---
    public function delete($id)
    {
        $this->clientesModel->delete($id);

SELECT *
FROM `clientes`
WHERE `cliente` LIKE '%Caze%' ESCAPE '!'
OR  `empresa` LIKE '%Caze%' ESCAPE '!'
OR  `email` LIKE '%Caze%' ESCAPE '!'
OR  `telefone` LIKE '%Caze%' ESCAPE '!'
OR  `cpf_cnpj` LIKE '%Caze%' ESCAPE '!'
---
    public function search()
{
    $query = $this->request->getGet('q');

    if (empty($query)) {
        return redirect()->route('home');
    }

    $clientes['clientes'] = $this->clientesModel
        ->like('cliente', $query)
        ->orLike('empresa', $query)
        ->orLike('email', $query)
        ->orLike('telefone', $query)
        ->orLike('cpf_cnpj', $query)
        ->findAll();