app/Controllers/PostsController.php

SELECT *
FROM `posts`
---
    public function index()
    {
        $posts['posts'] = $this->postModel->findAll();

INSERT INTO `posts` (`title`, `description`) VALUES ('academia', 'rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr')
---
    public function insert()
    {
        $validation = service('validation');

        $validation->setRules([
            'title' => 'required|min_length[3]',
            'description' => 'required|max_length[255]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $data = [
            'title' => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
        ];

        $this->postModel->save($data);

SELECT *
FROM `posts`
WHERE `posts`.`id` = '1'
---
    public function edit($id)
    {
        $data['post'] = $this->postModel->find($id);

UPDATE `posts` SET `title` = 'bater PR', `description` = 'llllllllllllllllllllllllllllll'
WHERE `posts`.`id` IN ('1')
---
    public function update($id)
    {
        $this->postModel->update($id, [
            'title' => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
        ]);

DELETE FROM `posts`
WHERE `id` IN ('2')
---
    public function delete($id)
    {
        $this->postModel->delete($id);

SELECT *
FROM `posts`
WHERE `title` LIKE '%academia%' ESCAPE '!'
OR  `description` LIKE '%academia%' ESCAPE '!'
---
    public function search()
{
    $query = $this->request->getGet('q');

    if (empty($query)) {
        return redirect()->route('home');
    }

    $posts['posts'] = $this->postModel
        ->like('title', $query)
        ->orLike('description', $query)
        ->findAll();